trade_exp/src/Documents/ВозвратТоваровОтКлиента/ВозвратТоваровОтКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВозвратТоваровОтКлиента</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.ДвижениеМаркированногоТовара</registerRecords>
  <attributes>
    <name>ЗаявкаНаВозвратТоваровОтКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Сделка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПокупательНеПлательщикНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДокументРеализации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПредусмотренЗалогЗаТару</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерРасходногоКассовогоОрдера</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРасходногоКассовогоОрдера</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СпособКомпенсации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЧекККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВозвратПереданнойМногооборотнойТары</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВыданыДенежныеСредства</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Кассир</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПричинаДляОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПричинаДляОрганизацииСпр</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДействияМенеджера</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерПретензии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаПретензии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ИспользуетсяДоговор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="079ec34d-066c-4845-ba17-d2482693b556">
    <name>СторноОрдер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="70e9e5a0-95a9-4618-b6cd-151f7f41f9bb">
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3a32023d-cb56-4527-9754-92bc93e44ff6">
    <name>ИсключитьИзКонтроля</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="40e5b2a4-c7be-4ede-bf7d-35de5f953c24">
    <name>СпособВводаКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6be545fb-1e1a-4d30-9554-2390bd3961a1">
    <name>ПодразделениеМенеджера</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fba413bc-839f-40ef-a9b2-7279747c08dc">
    <name>ОтделМенеджера</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НоменклатураОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НоменклатураНабора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>200</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Порча</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ХарактеристикаНабора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДокументРеализации</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ХарактеристикаОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаНачисленныхБонусныхБалловВВалюте</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаБонусныхБалловКСписаниюВВалюте</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаБонусныхБалловКСписанию</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="1fb5892b-e8f0-4be4-ad14-feed7c553f12">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="72d0be57-210d-4f57-bb99-9a68a3e4fc94">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="72338e32-64c3-4932-9afe-432c94be8596">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="dda0c316-494c-49fa-8dc3-0f2b7fb432c7">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="83a397d6-087d-43ea-8a1b-535791c0ad6f">
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="47a744cb-233b-44b2-908e-7ead60620ba2">
      <name>СуммаСНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыЗапасов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НачислениеБонусныхБаллов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>БонуснаяПрограммаЛояльности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаНачисления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ДатаСписания</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаБонусныхБаллов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОплатаБонуснымиБаллами</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>БонуснаяПрограммаЛояльности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаОплаты</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаБонусныхБаллов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/InformationRegisters/ДополнительныеСведения/ДополнительныеСведения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3ad5d8a7-3071-46aa-aebf-306bdb67983b">
  <name>ДополнительныеСведения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="ab7ef662-71c1-4d51-9f0f-ea8c5ea3df8a">
    <name>Значение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="cb954476-c551-4a06-9bcd-18d67ba47dc8">
    <name>Объект</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="79201015-bfae-463e-81f1-0ae2d3066f3f">
    <name>Свойство</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Documents/ВозвратТоваровОтКлиента/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура Док_ИспользуетсяДоговорПриИзмененииПосле(Элемент)

	Элементы.Договор.Доступность=Объект.ИспользуетсяДоговор;
	Элементы.Договор.Видимость = Объект.ИспользуетсяДоговор;

КонецПроцедуры
&ИзменениеИКонтроль("УстановитьДоступностьСпособаКомпенсации")
&НаКлиентеНаСервереБезКонтекста
Процедура Док_УстановитьДоступностьСпособаКомпенсации(Форма)

	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"СпособКомпенсации",
		"Доступность",
		Форма.СуммаКомпенсации <> 0
#Вставка
		И ПроверитьДоступностьРоли() 
#КонецВставки
		И Форма.Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиента"));
		


КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьДоступностьРоли()
	Возврат РольДоступна("ПолныеПрава");
КонецФункции

&НаСервере
Процедура Док_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// договор на форме	
	Элементы.ИспользуетсяДоговор.Доступность = Не значениезаполнено(Объект.ДокументРеализации);
	Элементы.Договор.Доступность = Объект.ИспользуетсяДоговор И Не значениезаполнено(Объект.ДокументРеализации);
	Элементы.Договор.Видимость = Объект.ИспользуетсяДоговор;
	// Доступность элементов
	Элементы.Партнер.Доступность = Не значениезаполнено(Объект.ДокументРеализации);
	Если Не значениезаполнено(Объект.ЧекККМ) Тогда
		Элементы.Контрагент.Доступность = Не значениезаполнено(Объект.ДокументРеализации);
	КонецЕсли;
	Элементы.Организация.Доступность = Не значениезаполнено(Объект.ДокументРеализации);
	Элементы.Соглашение.Доступность = Не значениезаполнено(Объект.ДокументРеализации);
	Элементы._ЗаполнитьШапкуПоДокументуПродажи.Видимость = Не значениезаполнено(Объект.ЧекККМ);
	
	Элементы.ИсключитьИзКонтроля.Доступность = РольДоступна("РазрешитьИсключатьДокументыИзКонтроляОрдерногоУчета");
	
	УстановитьДоступностьПоОтметкеКассы();
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
	Если Объект.Кассир.Пустая() Тогда // проверка отметки кассы
		Объект.ДатаПоследнегоОткрытия = ТекущаяДатаСеанса();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура Док__ЗаполнитьШапкуПоДокументуПродажиПосле(Команда)
	
	Док_ЗаполнитьШапкуПоЗаказуНаСервере();

КонецПроцедуры 

&НаСервере
Процедура Док_ЗаполнитьШапкуПоЗаказуНаСервере()
	
	Если ЗначениеЗаполнено(Объект.ДокументРеализации) Тогда
		
		Отказ = Ложь;
		Если АльтерраОбщегоНазначения.ЕстьЗеленение(Объект) > 0 Тогда
			Сообщить("В документе есть зелененные строки!");
			Отказ = Истина;
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.Кассир) Тогда
			Сообщить("В документе стоит отметка кассы!");
			Отказ = Истина;
		КонецЕсли;
		
		Если Не Отказ Тогда
			Объект.Партнер = Объект.ДокументРеализации.Партнер;
			Объект.Контрагент = Объект.ДокументРеализации.Контрагент;
			Объект.Соглашение = Объект.ДокументРеализации.Соглашение;
			Объект.Договор = Объект.ДокументРеализации.Договор;
			Объект.Организация = Объект.ДокументРеализации.Организация;
			Объект.ИспользуетсяДоговор = Объект.ДокументРеализации.ИспользуетсяДоговор;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура Док_ПередЗаписьюНаСервереПеред(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//ТЧВозврат = Объект.Товары.Выгрузить(, "Номенклатура, Характеристика, Назначение, Количество");
	//Если НЕ НоменклатурыХватает(ТЧВозврат) Тогда
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = "Возвращать номенклатуры больше, чем забирал покупатель запрещено";
	//	Сообщение.Сообщить();	
	//	Отказ = Истина
	//КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура Док_ПередЗаписьюНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ДокументРеализации = ТекущийОбъект.ДокументРеализации;
	ЧекККМ = ТекущийОбъект.ЧекККМ;
	Если Не Отказ И 
		ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
				
		ТЗТовары = ТекущийОбъект.Товары.Выгрузить( , "Номенклатура, Количество");
		ТЗТовары.Свернуть("Номенклатура", "Количество");
		
		Если ЗначениеЗаполнено(ЧекККМ) Тогда
			АльтерраОбщегоНазначения.НаличиеЗаказаНаДоставкуПриПолномВозврате(Отказ, ТЗТовары, ТекущийОбъект.Ссылка, ЧекККМ);
		ИначеЕсли ЗначениеЗаполнено(ДокументРеализации) И ТипЗнч(ДокументРеализации) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			АльтерраОбщегоНазначения.НаличиеЗаказаНаДоставкуПриПолномВозврате(Отказ, ТЗТовары, ТекущийОбъект.Ссылка, ДокументРеализации);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Док_ПослеЗаписиПосле(ПараметрыЗаписи)

	РассчитатьИтоговыеПоказателиВозврата(ЭтаФорма);
	ФинансыКлиентСервер.ПересчитатьСуммыВСтрокеРасшифровкиПлатежа(Объект, СуммаВсего);
	РассчитатьСуммуКомпенсации(ЭтаФорма); 
	
КонецПроцедуры

&НаКлиенте
Процедура Док_СкладПриИзмененииПосле(Элемент)
	
	Объект.Подразделение = АльтерраОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Склад, "Подразделение");
	ДопМодуль.КорректировкаСкладаДляКорректировкиНазначенияТоваров(Объект.Ссылка, Объект.Проведен, Объект.ПометкаУдаления, Объект.Склад);

КонецПроцедуры

&НаСервере
Процедура Док_МенеджерПриИзмененииПослеНаСервере()
	Объект.ПодразделениеМенеджера = ПолучитьПодразделениеМенеджера(Объект.Менеджер); 
	Объект.ОтделМенеджера = ПолучитьОтделМенеджера(Объект.Менеджер);
КонецПроцедуры

&НаКлиенте
Процедура Док_МенеджерПриИзмененииПосле(Элемент)
	Док_МенеджерПриИзмененииПослеНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьОтделМенеджера(Менеджер) 

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДополнительныеСведения.Значение.Наименование КАК Отдел
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|		ПО (ДополнительныеСведения.Объект = Пользователи.Ссылка)
		|ГДЕ
		|	Пользователи.Ссылка = &Ссылка
		|	И ДополнительныеСведения.Свойство.Наименование = ""Отделы (Пользователи)""";
	
	Запрос.УстановитьПараметр("Ссылка", Менеджер);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Отдел;
КонецФункции

&НаСервере
Функция ПолучитьПодразделениеМенеджера(Менеджер)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Пользователи.Подразделение КАК Подразделение
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Ссылка = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Менеджер);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Подразделение;
КонецФункции

#Область ОтметкаКассы

&НаКлиенте
Процедура ОтметкаКассы(Команда)
	
	Если Объект.ПричинаДляОрганизацииСпр.Пустая() Тогда
		Сообщить("Перед установкой отметки кассы необходимо заполнить причину возврата для организации (вкладка ""Доп. альтерра"")");
		Возврат;
	КонецЕсли;	
	
	Пользователь = ПолучитьПользователя();
	Объект.СостояниеЗаполненияМногооборотнойТары = ПредопределенноеЗначение("Перечисление.СостоянияЗаполненияМногооборотнойТары.НеПредлагатьЗаполнить");	
	ДопМодульКлиент.УстановитьОтметкуКассы(ЭтаФорма, Пользователь);
	УстановитьДоступностьПоОтметкеКассы();
		
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьПоОтметкеКассы()
	
	ДопМодуль.УстановитьДоступностьПоОтметкеКассыОбщий(ЭтаФорма);
	
	Если РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ОтметкаКассы") Тогда
		ЭтаФорма.Элементы.ПричинаДляОрганизацииСпр.ТолькоПросмотр = Ложь;
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура ЗаписьОтметкиКассы()  
	
	ПараметрЗаписи =  Новый Структура;
	ПараметрЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);
	ЭтаФорма.Записать(ПараметрЗаписи);
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьПользователя()
	Возврат ПараметрыСеанса.ТекущийПользователь;
КонецФункции	

#КонецОбласти

&НаКлиенте
Процедура СброситьПоСекции(Команда)
	
	МассивВыдСтрок = Элементы.Товары.ВыделенныеСтроки;
	Если МассивВыдСтрок.Количество() <> 0 тогда
		
		Для Каждого ТекСтрока Из МассивВыдСтрок Цикл
			СтрокаКоллекции = Объект.Товары.НайтиПоИдентификатору(ТекСтрока);
			СтрокаКоллекции.ТоварПринят = ЛОЖЬ;
			СтрокаКоллекции.Кладовщик = "";
		КонецЦикла;
	КонецЕсли;	

КонецПроцедуры

#Область ПересчетБонусов  

&НаКлиенте
Процедура Док_ТоварыКоличествоУпаковокПриИзмененииПосле(Элемент)
	
	ТекущиеДанные= Элементы.Товары.ТекущиеДанные;
	ТекущаяСтрока= Элементы.Товары.ТекущаяСтрока;
	
	ПересчитатьБонусыВСтрокеНаСервере(ТекущаяСтрока);
	РассчитатьИтоговыеПоказателиВозврата(ЭтаФорма);
	РассчитатьСуммуКомпенсации(ЭтаФорма); 
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьБонусыВСтрокеНаСервере(ТекущаяСтрока)
	
	СтрВозврата = Объект.Товары.НайтиПоИдентификатору(ТекущаяСтрока);
	СтрОснования = Неопределено;
	Если ТипЗнч(Объект.ДокументРеализации) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Основание = Объект.ДокументРеализации.Товары.Найти(стрВозврата.КодСтроки, "КодСтроки");
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.КоличествоУпаковок - ЕСТЬNULL(ВозвратТоваровОтКлиентаТовары.КоличествоУпаковок, 0) КАК КоличествоУпаковок,
		|	РеализацияТоваровУслугТовары.СуммаНачисленныхБонусныхБалловВВалюте - ЕСТЬNULL(ВозвратТоваровОтКлиентаТовары.СуммаНачисленныхБонусныхБалловВВалюте, 0) КАК СуммаНачисленныхБонусныхБалловВВалюте,
		|	РеализацияТоваровУслугТовары.СуммаБонусныхБалловКСписаниюВВалюте - ЕСТЬNULL(ВозвратТоваровОтКлиентаТовары.СуммаБонусныхБалловКСписаниюВВалюте, 0) КАК СуммаБонусныхБалловКСписаниюВВалюте,
		|	РеализацияТоваровУслугТовары.ПроцентАвтоматическойСкидки <> 0 КАК ЕстьСкидка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтКлиента.Товары КАК ВозвратТоваровОтКлиентаТовары
		|		ПО РеализацияТоваровУслугТовары.Ссылка = ВозвратТоваровОтКлиентаТовары.Ссылка.ДокументРеализации
		|			И РеализацияТоваровУслугТовары.Номенклатура = ВозвратТоваровОтКлиентаТовары.Номенклатура
		|			И РеализацияТоваровУслугТовары.Характеристика = ВозвратТоваровОтКлиентаТовары.Характеристика
		|			И (ВозвратТоваровОтКлиентаТовары.Ссылка <> &Возврат)
		|			И (ВозвратТоваровОтКлиентаТовары.Ссылка.Проведен)
		|ГДЕ
		|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
		|	И РеализацияТоваровУслугТовары.Номенклатура = &Номенклатура
		|	И РеализацияТоваровУслугТовары.Характеристика = &Характеристика";
		Запрос.УстановитьПараметр("Номенклатура", стрВозврата.Номенклатура);
		Запрос.УстановитьПараметр("Ссылка", Объект.ДокументРеализации);  
		Запрос.УстановитьПараметр("Возврат", Объект.Ссылка);
		Запрос.УстановитьПараметр("Характеристика", стрВозврата.Характеристика);
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			СтрОснования = ВыборкаДетальныеЗаписи;
		КонецЕсли;
	ИначеЕсли Объект.ЧекККМ<>Документы.ЧекККМ.ПустаяСсылка() Тогда
		Основание = Объект.ЧекККМ;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧекККМТовары.СуммаБонусныхБалловКСписаниюВВалюте КАК СуммаБонусныхБалловКСписаниюВВалюте,
		|	ЧекККМТовары.СуммаНачисленныхБонусныхБалловВВалюте КАК СуммаНачисленныхБонусныхБалловВВалюте,
		|	ЧекККМТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ЧекККМТовары.ПроцентАвтоматическойСкидки <> 0
		|		ИЛИ ЧекККМТовары.ПроцентРучнойСкидки <> 0 КАК ЕстьСкидка
		|ИЗ
		|	Документ.ЧекККМ.Товары КАК ЧекККМТовары
		|ГДЕ
		|	ЧекККМТовары.Ссылка = &Ссылка
		|	И ЧекККМТовары.Номенклатура = &Номенклатура
		|	И ЧекККМТовары.Характеристика = &Характеристика";
		Запрос.УстановитьПараметр("Номенклатура",  стрВозврата.Номенклатура);
		Запрос.УстановитьПараметр("Ссылка", Основание);
		Запрос.УстановитьПараметр("Характеристика", стрВозврата.Характеристика);
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			СтрОснования = ВыборкаДетальныеЗаписи;
		КонецЕсли;
	КонецЕсли;
	
	Если стрОснования <> Неопределено Тогда
		Если стрОснования.СуммаБонусныхБалловКСписаниюВВалюте > 0 Тогда
			стрВозврата.Количество = Мин(стрВозврата.КоличествоУпаковок, стрОснования.КоличествоУпаковок);
			СтруктураДействий = Новый Структура;
			ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, ЭтаФорма);

			стрВозврата.СуммаБонусныхБалловКСписаниюВВалюте= (стрОснования.СуммаБонусныхБалловКСписаниюВВалюте*стрВозврата.КоличествоУпаковок)/стрОснования.КоличествоУпаковок;
			стрВозврата.СуммаБонусныхБалловКСписанию= стрВозврата.СуммаБонусныхБалловКСписаниюВВалюте;
			стрВозврата.СуммаНачисленныхБонусныхБалловВВалюте= (стрОснования.СуммаНачисленныхБонусныхБалловВВалюте*стрВозврата.КоличествоУпаковок)/стрОснования.КоличествоУпаковок;
			
			Если Не СтрОснования.ЕстьСкидка Тогда
				БонусыАльтерра.ПересчитатьСуммыСУчетомБонусов(Объект, СтрВозврата);
			КонецЕсли;   
			
			ДокОбъект = РеквизитФормыВЗначение("Объект");
			БонусныеБаллыСервер.ЗаполнитьБонусныеБаллыВозвратТоваровОтКлиента(ДокОбъект); 
			ЗначениеВРеквизитФормы(ДокОбъект,"Объект");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область Зеленение 

&НаКлиенте
Процедура СКТоварыПередУдалением(Элемент, Отказ)
	
	Если ЗначениеЗаполнено(Элементы.товары.ТекущиеДанные.Кладовщик) тогда
		Предупреждение("Товар выдан со склада. Удаление строки запрещено!!!");
		Отказ = Истина;
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура СКТоварыПередНачаломИзменения(Элемент, Отказ)
	Если ЗначениеЗаполнено(Элементы.товары.ТекущиеДанные.Кладовщик) тогда
		Предупреждение("Товар выдан со склада. Удаление строки запрещено!!!");
		Отказ = Истина;
	КонецЕсли;	

КонецПроцедуры

&После("УстановитьУсловноеОформление")
Процедура Спр_УстановитьУсловноеОформление()
	
	АльтерраОбщегоНазначения.УстановитьОформлениеЗеленениеСтрокТабличныхЧастей(ЭтаФорма,"Товары");
	Элементы.УменьшенДолгСтрокой.Доступность=РольДоступна("ПолныеПрава") Или РольДоступна("ОтметкаКассы");

КонецПроцедуры

#КонецОбласти


#Область ВводНаОсновании    

&НаСервере
Процедура СоздатьНовыйДокумент(ИмяДокумента, НовыйОбъект)
	Документы[ИмяДокумента].ЗаполнитьДанныеПоОснованию(Объект.Ссылка, НовыйОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Док__ВводНаОснованииПропуск(Команда)
	
	ИмяДокумента = "Пропуск";
	ФормаДок = ПолучитьФорму("Документ." +  ИмяДокумента + ".ФормаОбъекта");
	ДанныеФормы = ФормаДок.Объект;
	
	Если Объект.Ссылка.Пустая() Тогда
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Данные еще не записаны.
		|Выполнение действия ""%1"" возможно только после записи данных.'"),
		"Реализация товаров и услуг");
		
		ПоказатьПредупреждение( , ТекстВопроса);
		Возврат;	
	КонецЕсли;
	
	СоздатьНовыйДокумент(ИмяДокумента, ДанныеФормы);
	КопироватьДанныеФормы(ДанныеФормы, ФормаДок.Объект);
	ФормаДок.Открыть();	
	
КонецПроцедуры 

#КонецОбласти

&НаКлиенте
Процедура Док__ОплатаНаМестеПосле(Команда)
		
	ОткрытьФорму("Обработка.БезналичнаяОплатаБезПодключенияОборудования.Форма",Новый Структура("ДокументПродажи",Объект.Ссылка));

КонецПроцедуры

&НаСервере
Функция НоменклатурыХватает(ТЧВозврат)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВозвратТоваровОтКлиентаТовары.Ссылка КАК Ссылка,
		|	ВозвратТоваровОтКлиентаТовары.Номенклатура КАК Номенклатура,
		|	ВозвратТоваровОтКлиентаТовары.Характеристика КАК Характеристика,
		|	-1 * ВозвратТоваровОтКлиентаТовары.Количество КАК Количество,
		|	ВозвратТоваровОтКлиентаТовары.Назначение КАК Назначение
		|ПОМЕСТИТЬ ВТКоличествоПоДокументам
		|ИЗ
		|	Документ.ВозвратТоваровОтКлиента.Товары КАК ВозвратТоваровОтКлиентаТовары
		|ГДЕ
		|	ВозвратТоваровОтКлиентаТовары.ДокументРеализации = &Ссылка
		|	И НЕ ВозвратТоваровОтКлиентаТовары.Ссылка.ПометкаУдаления
		|	И ВозвратТоваровОтКлиентаТовары.Ссылка.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КорректировкаРеализацииРасхождения.Ссылка,
		|	КорректировкаРеализацииРасхождения.Номенклатура,
		|	КорректировкаРеализацииРасхождения.Характеристика,
		|	КорректировкаРеализацииРасхождения.Количество,
		|	КорректировкаРеализацииРасхождения.Назначение
		|ИЗ
		|	Документ.КорректировкаРеализации.Расхождения КАК КорректировкаРеализацииРасхождения
		|ГДЕ
		|	КорректировкаРеализацииРасхождения.Ссылка.ДокументОснование = &Ссылка
		|	И НЕ КорректировкаРеализацииРасхождения.Ссылка.ПометкаУдаления
		|	И КорректировкаРеализацииРасхождения.Ссылка.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.Ссылка,
		|	РеализацияТоваровУслугТовары.Номенклатура,
		|	РеализацияТоваровУслугТовары.Характеристика,
		|	РеализацияТоваровУслугТовары.Количество,
		|	РеализацияТоваровУслугТовары.Назначение
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|ГДЕ
		|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
		|	И НЕ РеализацияТоваровУслугТовары.Ссылка.ПометкаУдаления
		|	И РеализацияТоваровУслугТовары.Ссылка.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТКоличествоПоДокументам.Номенклатура КАК Номенклатура,
		|	ВТКоличествоПоДокументам.Характеристика КАК Характеристика,
		|	ВТКоличествоПоДокументам.Назначение КАК Назначение,
		|	СУММА(ВТКоличествоПоДокументам.Количество) КАК Количество 
		|ПОМЕСТИТЬ ВТОстатки
		|ИЗ
		|	ВТКоличествоПоДокументам КАК ВТКоличествоПоДокументам
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТКоличествоПоДокументам.Номенклатура,
		|	ВТКоличествоПоДокументам.Характеристика,
		|	ВТКоличествоПоДокументам.Назначение
		|	;
		|///////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ 
		|	ТЗТЧВозврат.Номенклатура КАК Номенклатура,
		|	ТЗТЧВозврат.Характеристика КАК Характеристика,
		|	ТЗТЧВозврат.Назначение КАК Назначение,
		|	ТЗТЧВозврат.Количество КАК Количество
		|ПОМЕСТИТЬ ВТТЧВозврат
		|ИЗ
		|	&ТЗТЧВозврат КАК ТЗТЧВозврат
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТТЧВозврат.Номенклатура КАК Номенклатура,
		|	ВТТЧВозврат.Характеристика КАК Характеристика,
		|	ВТТЧВозврат.Назначение КАК Назначение,
		|	(ВТОстатки.Количество-ВТТЧВозврат.Количество) КАК Количество
		|ИЗ
		|	ВТТЧВозврат КАК ВТТЧВозврат
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстатки КАК ВТОстатки
		|			ПО (ВТТЧВозврат.Номенклатура = ВТОстатки.Номенклатура
		|				И ВТТЧВозврат.Характеристика = ВТОстатки.Характеристика
		|				И ВТТЧВозврат.Назначение = ВТОстатки.Назначение)
		|Где
		|	(ВТОстатки.Количество-ВТТЧВозврат.Количество) < 0";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка.ДокументРеализации);
	Запрос.УстановитьПараметр("ТЗТЧВозврат", ТЧВозврат);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат Ложь; 
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции;
